In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'names':['Sarah','Ahmed','Ali'],
    'age':[50,60,70],
    'cgpa':[3.4,2.9,3.6],
    'marks':[-5,2,6],
    'address':['Karachi','Lahore','Islamabad']    
})
df

   names  age  cgpa  marks    address
0  Sarah   50   3.4     -5    Karachi
1  Ahmed   60   2.9      2     Lahore
2    Ali   70   3.6      6  Islamabad

In [3]:
df.head()
df.tail()
df.sample(2)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    3 non-null      object
 1   age      3 non-null      int64
 2   cgpa     3 non-null      float64
 3   marks    3 non-null      int64
 4   address  3 non-null      object
dtypes: float64(1), int64(2), object(2)
memory usage: 248.0+ bytes

In [4]:
df.describe()

        age      cgpa     marks
count   3.0  3.000000  3.000000
mean   60.0  3.300000  1.000000
std    10.0  0.360555  5.567764
min    50.0  2.900000 -5.000000
25%    55.0  3.150000 -1.500000
50%    60.0  3.400000  2.000000
75%    65.0  3.500000  4.000000
max    70.0  3.600000  6.000000

In [5]:
df["marks"].sum()
# df["marks"].mean()
# df["marks"].mode()
# df["marks"].max()
# df["marks"].min()
# df["marks"].var()
# df["marks"].std()
# df["marks"].cumsum()
# df["marks"].cumprod()
# df["marks"].sort_values()
# df["marks"].sort_index()
# df["marks"].value_counts()            # value_count gives the count of each individual value, if a value is repeated you can see its count
# df["marks"].count()                   # count method gives the total values 
# df["marks"].size

# size() counts all elements, including NaN values.
# count() counts only non-null (valid) values, excluding NaN values.

3

In [6]:
# idxmin(axis=0, skipna=True, *args, **kwargs)
df["marks"].idxmax()    
df["marks"].idxmin()

0

3

In [8]:
df["age"].isnull()

0    False
1    False
2    False
Name: age, dtype: bool

In [9]:
df["names"].isin(['Sarah','Ali'])

0     True
1    False
2     True
Name: names, dtype: bool

In [10]:
df["cgpa"].between(1,3)

0    False
1     True
2    False
Name: cgpa, dtype: bool

In [11]:
data = {'col_0': [9, -3, 0, -1, 5], 'col_1': [-2, -7, 6, 8, -5]}
df = pd.DataFrame(data)
df.clip(-4, 6)      #  replace all values less than -4 to -4 and values mogreater than 6 to 6

   col_0  col_1
0      6     -2
1     -3     -4
2      0      6
3     -1      6
4      5     -4

In [12]:
# drop_duplicates(*, keep='first/last', inplace=False)
fruits = pd.Series(['apple', 'cherry', 'mango', 'apple'])

result=fruits.duplicated()         # Gives the count
print(result)

# fruits.drop_duplicates()         # you can keep first or last value by providing keep='First' in argument
# df.drop_duplicates(subset=['ages', 'names'])

0    False
1    False
2    False
3     True
dtype: bool

In [13]:
s = pd.Series([1, 2, 3, 1])
s.is_unique

False

In [14]:
df = pd.DataFrame({
    'names':['Sarah','Ahmed','Ali'],
    'age':[50,60,50],
    'cgpa':[3.4,2.9,3.6],
    'address':['Karachi','Lahore','Islamabad']    
})

result = df['age'].unique()             # Return unique values of Series object.
print(result)
result = df['age'].nunique()            # Return unique values count
print(result)

[50 60]
2

In [15]:
# Series.items()
# Lazily iterate over (index, value) tuples.


s = pd.Series(['A', 'B', 'C'])
for index, value in s.items():
    print(f"Index : {index}, Value : {value}")

Index : 0, Value : A
Index : 1, Value : B
Index : 2, Value : C

In [16]:
# combine(other, func, fill_value=None)
# Combine the Series and other using func to perform elementwise selection for combined Series.
s1 = pd.Series({'falcon': 330.0, 'eagle': 160.0})
s2 = pd.Series({'falcon': 345.0, 'eagle': 200.0, 'duck': 30.0})

s1.combine(s2, max)
s1.combine(s2, max, fill_value=0)

duck       30.0
eagle     200.0
falcon    345.0
dtype: float64